telespial/EdgeAI_smart_pong_demo_NXP_FRDM-MCXN947/src/game/ai.c
static void ai_style_update(ai_learn_profile_t *p, uint8_t style, int32_t reward_q8)
{
    if (!p || style > 3u) return;
    if (p->style_trials[style] < 65535u) p->style_trials[style]++;

    int32_t q = (int32_t)p->style_value_q8[style];
    uint16_t n = p->style_trials[style];
    int32_t den = (n < 24u) ? (int32_t)n : 24;
    if (den < 1) den = 1;
    q += (reward_q8 - q) / den;

    if (q > 32767) q = 32767;
    if (q < -32768) q = -32768;
    p->style_value_q8[style] = (int16_t)q;
}

static void ai_style_apply(const pong_game_t *g,
                           const ai_learn_profile_t *p,
                           uint8_t style,
                           float confidence,
                           float *y_hit,
                           float *z_hit)
{
    if (!g || !p || !y_hit || !z_hit) return;

    confidence = clampf(confidence, 0.0f, 1.0f);
    float k = 0.45f + (0.55f * confidence);
    uint32_t n_hist = (uint32_t)p->hits + (uint32_t)p->misses;
    float maturity = clampf((float)n_hist * (1.0f / 24.0f), 0.0f, 1.0f);
    k *= (0.30f + 0.70f * maturity);

    float edge = 0.07f + (0.28f * p->corner_bias);
    float edge_y = edge + 0.08f * absf(g->ball.vy);
    float edge_z = edge + 0.08f * absf(g->ball.vz);

    if (style == 0u)
    {
        float hold = clampf(0.22f + 0.65f * p->center_bias, 0.00f, 0.70f) * k;
        *y_hit += (0.5f - *y_hit) * hold;
        *z_hit += (0.5f - *z_hit) * hold;
    }
    else if (style == 1u)
    {
        *y_hit += signf_nonzero(g->ball.y - 0.5f) * edge_y * k;
    }
    else if (style == 2u)
    {
        *z_hit += signf_nonzero(g->ball.z - 0.5f) * edge_z * k;
    }
    else
    {
        *y_hit += signf_nonzero(g->ball.y - 0.5f) * edge_y * k;
        *z_hit += signf_nonzero(g->ball.z - 0.5f) * edge_z * k;
    }
}

static ai_learn_profile_t *ai_profile_side(pong_game_t *g, bool right_side)
{
    if (!g) return NULL;
    return right_side ? &g->ai_profile_right : &g->ai_profile_left;
}

static const ai_learn_profile_t *ai_profile_side_const(const pong_game_t *g, bool right_side)
{
    if (!g) return NULL;
    return right_side ? &g->ai_profile_right : &g->ai_profile_left;
}

static bool ai_learning_side_selected(const pong_game_t *g, bool right_side)
{
    if (!g) return false;
    if (right_side)
    {
        if (!g->ai_right_active) return false;
        if (g->ai_learn_mode == kAiLearnModeAiAlgo) return false;
        return true;
    }

    if (!g->ai_left_active) return false;
    if (g->ai_learn_mode == kAiLearnModeAlgoAi) return false;
    return true;
}

static void ai_learning_commit_store(const pong_game_t *g)
{
    if (!g || !g->persistent_learning) return;
    s_learn_store.magic = EDGEAI_LEARN_STORE_MAGIC;
    s_learn_store.version = EDGEAI_LEARN_STORE_VERSION;
    s_learn_store.crc32 = 0u;
    s_learn_store.left = g->ai_profile_left;
    s_learn_store.right = g->ai_profile_right;
    s_learn_store.crc32 = ai_store_checksum(&s_learn_store);
    s_learn_store_dirty = true;
}

static void ai_learning_load_store(pong_game_t *g)
{
    if (!g || !g->persistent_learning) return;

    ai_learn_store_t flash_store;
    if (ai_flash_read_store(&flash_store))
    {
        s_learn_store = flash_store;
        s_learn_store_dirty = false;
        g->ai_profile_left = s_learn_store.left;
        g->ai_profile_right = s_learn_store.right;
        ai_profile_clamp(&g->ai_profile_left);
        ai_profile_clamp(&g->ai_profile_right);
        return;
    }

    if (s_learn_store.magic == EDGEAI_LEARN_STORE_MAGIC && s_learn_store.version == EDGEAI_LEARN_STORE_VERSION &&
        ai_store_checksum(&s_learn_store) == s_learn_store.crc32)
    {
        g->ai_profile_left = s_learn_store.left;
        g->ai_profile_right = s_learn_store.right;
        ai_profile_clamp(&g->ai_profile_left);
        ai_profile_clamp(&g->ai_profile_right);
    }
    else
    {
        s_learn_store.magic = EDGEAI_LEARN_STORE_MAGIC;
        s_learn_store.version = EDGEAI_LEARN_STORE_VERSION;
        s_learn_store.crc32 = 0u;
        s_learn_store.left = g->ai_profile_left;
        s_learn_store.right = g->ai_profile_right;
        s_learn_store.crc32 = ai_store_checksum(&s_learn_store);
        s_learn_store_dirty = false;
    }
}

void ai_learning_reset_session(pong_game_t *g)
{
    if (!g) return;
    g->ai_profile_left = ai_profile_default();
    g->ai_profile_right = ai_profile_default();
    ai_learning_load_store(g);
}

void ai_learning_set_mode(pong_game_t *g, ai_learn_mode_t mode)
{
    if (!g) return;
    switch (mode)
    {
        case kAiLearnModeBoth:
        case kAiLearnModeAiAlgo:
        case kAiLearnModeAlgoAi:
            g->ai_learn_mode = mode;
            break;
        default:
            g->ai_learn_mode = kAiLearnModeBoth;
            break;
    }
}

void ai_learning_set_persistent(pong_game_t *g, bool enabled)
{
    if (!g) return;
    if (enabled)
    {
        g->persistent_learning = true;
        ai_learning_load_store(g);
        return;
    }

    /* Persistence OFF means no carry-over advantage:
     * clear current learned profiles and wipe stored snapshot.
     */
    g->persistent_learning = false;
    ai_learning_reset_session(g);
    memset(&s_learn_store, 0, sizeof(s_learn_store));
    s_learn_store_dirty = false;
    ai_flash_clear_store();
}

void ai_learning_sync_store(pong_game_t *g)
{
    if (!g || !g->persistent_learning) return;
    if (!s_learn_store_dirty) return;
    if (ai_flash_write_store(&s_learn_store))
    {
        s_learn_store_dirty = false;
    }
}

void ai_learning_on_paddle_hit(pong_game_t *g, bool left_side)
{
    if (!g) return;
    bool right_side = !left_side;
    if (!ai_learning_side_selected(g, right_side)) return;

    ai_learn_profile_t *p = ai_profile_side(g, right_side);
    if (!p) return;

    p->hits = clampu16((uint32_t)p->hits + 1u, 65535u);

    /* Successful return: slightly cleaner and quicker tracking, with mild anticipation. */
    p->noise_scale *= 0.987f;
    p->speed_scale += 0.008f;
    p->lead_scale += 0.005f;

    {
        uint8_t style = (p->last_style > 3u) ? 0u : p->last_style;
        float ahy = absf(g->last_hit_dy);
        float ahz = absf(g->last_hit_dz);
        int32_t reward = 18 << 8;
        if (style == 0u)
        {
            reward += ((ahy + ahz) < 0.60f) ? (6 << 8) : (-4 << 8);
            p->center_bias += 0.012f;
            p->corner_bias -= 0.003f;
        }
        else if (style == 1u)
        {
            reward += (ahy > 0.55f) ? (8 << 8) : (-3 << 8);
            p->corner_bias += 0.010f;
            p->center_bias -= 0.003f;
        }
        else if (style == 2u)
        {
            reward += (ahz > 0.55f) ? (8 << 8) : (-3 << 8);
            p->corner_bias += 0.010f;
            p->center_bias -= 0.003f;
        }
        else
        {
            reward += ((ahy + ahz) > 1.05f) ? (10 << 8) : (-4 << 8);
            p->corner_bias += 0.012f;
            p->center_bias -= 0.004f;
        }
        ai_style_update(p, style, reward);
    }

    ai_profile_clamp(p);
    ai_learning_commit_store(g);
}

