telespial/EdgeAI_smart_pong_demo_NXP_FRDM-MCXN947/src/game/ai.c
void ai_learning_on_miss(pong_game_t *g, bool left_side)
{
    if (!g) return;
    bool right_side = !left_side;
    if (!ai_learning_side_selected(g, right_side)) return;

    ai_learn_profile_t *p = ai_profile_side(g, right_side);
    if (!p) return;

    p->misses = clampu16((uint32_t)p->misses + 1u, 65535u);

    /* Missed return: make AI react faster and reduce wander so it recovers over the session. */
    p->noise_scale *= 0.94f;
    p->speed_scale += 0.045f;
    p->lead_scale += 0.030f;

    {
        uint8_t style = (p->last_style > 3u) ? 0u : p->last_style;
        int32_t penalty = -22 << 8;
        ai_style_update(p, style, penalty);
        if (style == 0u)
        {
            p->center_bias -= 0.014f;
            p->corner_bias += 0.004f;
        }
        else
        {
            p->corner_bias -= 0.012f;
            p->center_bias += 0.004f;
        }
    }

    ai_profile_clamp(p);
    ai_learning_commit_store(g);
}

static void ai_sim_wall(float *p, float *v, float r)
{
    if (!p || !v) return;
    if ((*p - r) < 0.0f)
    {
        *p = r;
        *v = absf(*v);
    }
    if ((*p + r) > 1.0f)
    {
        *p = 1.0f - r;
        *v = -absf(*v);
    }
}

static void ai_predict_right(const pong_game_t *g, float dt, float *out_y, float *out_z, float *out_t)
{
    if (!out_y || !out_z || !out_t)
        return;

    *out_y = 0.5f;
    *out_z = 0.5f;
    *out_t = 0.0f;
    if (!g) return;

    if (g->ball.vx <= 0.0f)
    {
        *out_y = 0.5f;
        *out_z = 0.5f;
        *out_t = 0.0f;
        return;
    }

    float x = g->ball.x;
    float y = g->ball.y;
    float z = g->ball.z;
    float vx = g->ball.vx;
    float vy = g->ball.vy;
    float vz = g->ball.vz;
    float r = g->ball.r;

    const float x_hit = g->paddle_r.x_plane - r;
    const int max_steps = 240; /* ~4s at 60 Hz */

    for (int i = 0; i < max_steps; i++)
    {
        x += vx * dt;
        y += vy * dt;
        z += vz * dt;
        ai_sim_wall(&y, &vy, r);
        ai_sim_wall(&z, &vz, r);
        if (x >= x_hit)
        {
            *out_y = clampf(y, 0.0f, 1.0f);
            *out_z = clampf(z, 0.0f, 1.0f);
            *out_t = (float)(i + 1) * dt;
            return;
        }
    }
}

static void ai_predict_left(const pong_game_t *g, float dt, float *out_y, float *out_z, float *out_t)
{
    if (!out_y || !out_z || !out_t)
        return;

    *out_y = 0.5f;
    *out_z = 0.5f;
    *out_t = 0.0f;
    if (!g) return;

    if (g->ball.vx >= 0.0f)
    {
        *out_y = 0.5f;
        *out_z = 0.5f;
        *out_t = 0.0f;
        return;
    }

    float x = g->ball.x;
    float y = g->ball.y;
    float z = g->ball.z;
    float vx = g->ball.vx;
    float vy = g->ball.vy;
    float vz = g->ball.vz;
    float r = g->ball.r;

    const float x_hit = g->paddle_l.x_plane + r;
    const int max_steps = 240; /* ~4s at 60 Hz */

    for (int i = 0; i < max_steps; i++)
    {
        x += vx * dt;
        y += vy * dt;
        z += vz * dt;
        ai_sim_wall(&y, &vy, r);
        ai_sim_wall(&z, &vz, r);
        if (x <= x_hit)
        {
            *out_y = clampf(y, 0.0f, 1.0f);
            *out_z = clampf(z, 0.0f, 1.0f);
            *out_t = (float)(i + 1) * dt;
            return;
        }
    }
}

void ai_init(pong_game_t *g)
{
    if (!g) return;
    (void)npu_hal_init(&g->npu);
    ai_learning_reset_session(g);
}

static void ai_build_features(const pong_game_t *g, float f[16])
{
    if (!g || !f) return;
    memset(f, 0, 16 * sizeof(f[0]));

    f[0] = g->ball.x;
    f[1] = g->ball.y;
    f[2] = g->ball.z;
    f[3] = g->ball.vx;
    f[4] = g->ball.vy;
    f[5] = g->ball.vz;

    f[6] = g->paddle_l.y;
    f[7] = g->paddle_l.z;
    f[8] = g->paddle_l.vy;
    f[9] = g->paddle_l.vz;

    f[10] = g->paddle_r.y;
    f[11] = g->paddle_r.z;

    int32_t sd = (int32_t)g->score.left - (int32_t)g->score.right;
    if (sd > 20) sd = 20;
    if (sd < -20) sd = -20;
    f[12] = (float)sd * (1.0f / 20.0f);

    f[13] = g->last_hit_dy;
    f[14] = g->last_hit_dz;
    f[15] = 1.0f;
}

static void ai_mirror_features_x(const float in[16], float out[16])
{
    if (!in || !out) return;

    /* Keep the NPU feature view always predicting the right paddle plane:
     * - mirror x and vx
     * - swap left/right paddle features
     * - flip score diff sign (left-right -> right-left)
     */
    memcpy(out, in, 16 * sizeof(out[0]));

    out[0] = 1.0f - in[0];   /* ball.x */
    out[3] = -in[3];         /* ball.vx */

    /* left paddle (6..9) <-> right paddle (10..11) */
    out[6] = in[10]; /* opp y */
    out[7] = in[11]; /* opp z */
    out[8] = 0.0f;
    out[9] = 0.0f;

    out[10] = in[6]; /* self y */
    out[11] = in[7]; /* self z */

    out[12] = -in[12];
}

static uint32_t ai_update_div(const pong_game_t *g, bool use_npu)
{
    uint8_t d = g ? g->difficulty : 2;
    if (d < 1) d = 1;
    if (d > 3) d = 3;

    if (!use_npu)
    {
        switch (d)
        {
            case 1: return 5u;
            case 2: return 3u;
            default: return 2u;
        }
    }

    /* In mixed SKILL modes, keep EdgeAI control cadence near ALGO cadence so the
     * selected AI side is not handicapped by slower NPU refresh.
     */
    if (g && (g->ai_learn_mode != kAiLearnModeBoth))
    {
        switch (d)
        {
            case 1: return 5u;
            case 2: return 3u;
            default: return 2u;
        }
    }

    /* NPU path: throttle updates to protect frame pacing, then adapt to observed latency. */
    uint32_t div = 4u;
    switch (d)
    {
        case 1: div = 9u; break;
        case 2: div = 7u; break;
        default: div = 5u; break;
    }

    uint32_t avg_us = g ? g->npu.avg_infer_us : 0u;
    if (avg_us > 14000u) div += 3u;
    else if (avg_us > 9000u) div += 2u;
    else if (avg_us > 5000u) div += 1u;

    if (div < 2u) div = 2u;
    if (div > 14u) div = 14u;
    return div;
}

static float ai_noise(const pong_game_t *g, bool right_side)
{
    uint8_t d = g ? g->difficulty : 2;
    if (d < 1) d = 1;
    if (d > 3) d = 3;

    float n = 0.015f;
    switch (d)
    {
        case 1: n = 0.032f; break;
        case 2: n = 0.015f; break;
        default: n = 0.007f; break;
    }

