telespial/EdgeAI_smart_pong_demo_NXP_FRDM-MCXN947/src/game/ai.c
    /* Show clear behavior difference when NPU path is disabled. */
    if (g && !g->ai_enabled)
    {
        n *= 1.7f;
    }

    if (g && ai_learning_side_selected(g, right_side))
    {
        const ai_learn_profile_t *p = ai_profile_side_const(g, right_side);
        if (p)
        {
            n *= p->noise_scale;
        }
        if (g->ai_learn_mode != kAiLearnModeBoth)
        {
            n *= 0.85f;
        }
    }

    n = clampf(n, 0.002f, 0.08f);
    return n;
}

static float ai_max_speed(const pong_game_t *g, bool right_side)
{
    uint8_t d = g ? g->difficulty : 2;
    if (d < 1) d = 1;
    if (d > 3) d = 3;
    float s = 1.48f;
    switch (d)
    {
        case 1: s = 1.22f; break;
        case 2: s = 1.48f; break;
        default: s = 1.78f; break;
    }

    if (g && !g->ai_enabled)
    {
        s *= 0.82f;
    }

    if (g && ai_learning_side_selected(g, right_side))
    {
        const ai_learn_profile_t *p = ai_profile_side_const(g, right_side);
        if (p)
        {
            s *= p->speed_scale;
        }
        if (g->ai_learn_mode != kAiLearnModeBoth)
        {
            s *= 1.08f;
        }
    }

    s = clampf(s, 0.70f, 2.60f);
    return s;
}

static float ai_lead_scale(const pong_game_t *g, bool right_side)
{
    if (!g) return 1.0f;
    if (!ai_learning_side_selected(g, right_side)) return 1.0f;
    const ai_learn_profile_t *p = ai_profile_side_const(g, right_side);
    if (!p) return 1.0f;
    return clampf(p->lead_scale, 0.70f, 2.00f);
}

static void ai_update_telemetry_window(pong_game_t *g)
{
    if (!g) return;

    if (g->ai_telemetry_start_cycles == 0u)
    {
        g->ai_telemetry_start_cycles = time_hal_cycles();
        return;
    }

    uint32_t elapsed_us = time_hal_elapsed_us(g->ai_telemetry_start_cycles);
    if (elapsed_us < 1000000u) return;

    uint32_t npu_hz = 0u;
    uint32_t fb_hz = 0u;

    if (elapsed_us > 0u)
    {
        npu_hz = (uint32_t)(((uint64_t)g->ai_npu_attempts_window * 1000000ull) / (uint64_t)elapsed_us);
        fb_hz = (uint32_t)(((uint64_t)g->ai_fallback_window * 1000000ull) / (uint64_t)elapsed_us);
    }

    g->ai_npu_rate_hz = clampu16(npu_hz, 999u);
    g->ai_fallback_rate_hz = clampu16(fb_hz, 999u);
    g->ai_npu_attempts_window = 0u;
    g->ai_fallback_window = 0u;
    g->ai_telemetry_start_cycles = time_hal_cycles();
}

static void ai_step_one(pong_game_t *g, float dt, pong_paddle_t *p, bool right_side)
{
    if (!g || !p) return;

    bool ball_toward = right_side ? (g->ball.vx > 0.0f) : (g->ball.vx < 0.0f);
    bool side_edgeai = ai_learning_side_selected(g, right_side);
    bool use_npu = g->ai_enabled && side_edgeai && ball_toward;

    /* Refresh AI target at a lower rate for difficulty and lower CPU. */
    uint32_t div = ai_update_div(g, use_npu);
    if (div == 0u) div = 1u;
    if ((g->frame % div) == 0u)
    {
        float y_hit = 0.5f;
        float z_hit = 0.5f;
        float t_hit = 0.0f;
        bool used_npu = false;
        float npu_confidence = 1.0f;

        if (ball_toward)
        {
            if (use_npu)
            {
                float feat[16];
                float feat2[16];
                ai_build_features(g, feat);

                const float *use_feat = feat;
                if (!right_side)
                {
                    ai_mirror_features_x(feat, feat2);
                    use_feat = feat2;
                }

                g->ai_npu_attempts_window++;
                npu_pred_t pred;
                used_npu = npu_hal_predict(&g->npu, use_feat, &pred);
                if (used_npu)
                {
                    y_hit = pred.y_hit;
                    z_hit = pred.z_hit;
                    t_hit = pred.t_hit;

                    /* In mixed SKILL modes, blend NPU with analytic prediction to
                     * keep EdgeAI competitive against fixed ALGO baseline.
                     */
                    if (g->ai_learn_mode != kAiLearnModeBoth)
                    {
                        float y_ref = 0.5f;
                        float z_ref = 0.5f;
                        float t_ref = 0.0f;
                        if (right_side)
                        {
                            ai_predict_right(g, dt, &y_ref, &z_ref, &t_ref);
                        }
                        else
                        {
                            ai_predict_left(g, dt, &y_ref, &z_ref, &t_ref);
                        }

                        /* Confidence gate: when NPU diverges from analytic physics, bias heavily
                         * toward the analytic path to preserve competitiveness.
                         */
                        float dy = absf(y_hit - y_ref);
                        float dz = absf(z_hit - z_ref);
                        float dtau = absf(t_hit - t_ref);
                        float disagreement = dy + dz + (0.60f * dtau);

                        float npu_w = 0.16f;
                        if (disagreement >= 0.22f)
                        {
                            npu_w = 0.0f;
                        }
                        else if (disagreement > 0.0f)
                        {
                            float trust = 1.0f - (disagreement / 0.22f);
                            npu_w *= clampf(trust, 0.0f, 1.0f);
                        }
                        npu_confidence = clampf(1.0f - (disagreement / 0.22f), 0.0f, 1.0f);

                        const float ref_w = 1.0f - npu_w;
                        y_hit = (ref_w * y_ref) + (npu_w * y_hit);
                        z_hit = (ref_w * z_ref) + (npu_w * z_hit);
                        t_hit = (ref_w * t_ref) + (npu_w * t_hit);
                    }
                }
            }

            if (!used_npu)
            {
                if (right_side)
                {
                    ai_predict_right(g, dt, &y_hit, &z_hit, &t_hit);
                }
                else
                {
                    ai_predict_left(g, dt, &y_hit, &z_hit, &t_hit);
                }
            }

