telespial/EdgeAI_smart_pong_demo_NXP_FRDM-MCXN947/src/game/ai.c
            /* Learned anticipation: shift target along projected travel based on side profile. */
            {
                float lead = ai_lead_scale(g, right_side);
                float t_use = clampf(t_hit, 0.0f, 0.80f);
                float k = (lead - 1.0f) * 0.45f;
                y_hit += g->ball.vy * t_use * k;
                z_hit += g->ball.vz * t_use * k;
            }

            if (side_edgeai)
            {
                ai_learn_profile_t *lp = ai_profile_side(g, right_side);
                if (lp)
                {
                    uint8_t style = ai_style_select(g, lp);
                    lp->last_style = style;
                    ai_style_apply(g, lp, style, used_npu ? npu_confidence : 0.80f, &y_hit, &z_hit);
                }
            }

            /* Add small noise to avoid perfect play. */
            float noise = ai_noise(g, right_side);
            y_hit += rand_f(g, -noise, noise);
            z_hit += rand_f(g, -noise, noise);
        }

        if (!used_npu)
        {
            g->ai_fallback_window++;
        }

        p->target_y = clampf(y_hit, 0.0f, 1.0f);
        p->target_z = clampf(z_hit, 0.0f, 1.0f);
    }

    /* Speed-limited movement. */
    float prev_y = p->y;
    float prev_z = p->z;

    float max_speed = ai_max_speed(g, right_side);
    float max_step = max_speed * dt;

    float dy = p->target_y - p->y;
    float dz = p->target_z - p->z;
    dy = clampf(dy, -max_step, max_step);
    dz = clampf(dz, -max_step, max_step);
    p->y += dy;
    p->z += dz;

    /* Clamp inside arena. */
    float hy = p->size_y * 0.5f;
    float hz = p->size_z * 0.5f;
    p->y = clampf(p->y, hy, 1.0f - hy);
    p->z = clampf(p->z, hz, 1.0f - hz);

    p->vy = (p->y - prev_y) / dt;
    p->vz = (p->z - prev_z) / dt;
}

void ai_step(pong_game_t *g, float dt, bool ai_left, bool ai_right)
{
    if (!g) return;

    if (ai_left)
    {
        ai_step_one(g, dt, &g->paddle_l, false);
    }
    if (ai_right)
    {
        ai_step_one(g, dt, &g->paddle_r, true);
    }

    /* Gentle decay toward baseline so long sessions stay stable. */
    if (ai_learning_side_selected(g, false))
    {
        ai_learn_profile_t *p = &g->ai_profile_left;
        p->speed_scale += (1.0f - p->speed_scale) * 0.0008f;
        p->noise_scale += (1.0f - p->noise_scale) * 0.0010f;
        p->lead_scale += (1.0f - p->lead_scale) * 0.0008f;
        ai_profile_clamp(p);
    }
    if (ai_learning_side_selected(g, true))
    {
        ai_learn_profile_t *p = &g->ai_profile_right;
        p->speed_scale += (1.0f - p->speed_scale) * 0.0008f;
        p->noise_scale += (1.0f - p->noise_scale) * 0.0010f;
        p->lead_scale += (1.0f - p->lead_scale) * 0.0008f;
        ai_profile_clamp(p);
    }

    ai_update_telemetry_window(g);
}
